{
  "showcases": [
    {
      "title": "Chico Mino (Ongoing)",
      "image": "chico-preview.png",
      "info": [
        {
          "title": "Preview",
          "summary": "https://youtu.be/dQT3IjM0D4s",
          "link": true
        },
        {
          "title": "What I did",
          "summary": "Developed a strategy game inspired by Pikmin featuring a character creator, advanced pathfinding, and a responsive UI built with object-oriented design principles. Implemented queue systems and asynchronous operations to optimize performance for handling numerous actors, integrated custom visual shaders, and utilized external physics libraries to enhance gameplay realism and efficiency.",
          "link": false
        },
        {
          "title": "Worth Noting",
          "summary": "I created a tool using my art program’s API to manually export and stitch separate body parts, enabling a modular character creation system that preserves traditional animation while emulating a 3D model workflow.",
          "link": false
        },
        {
          "title": "Tools",
          "summary": "Godot, Python, Figma",
          "link": false
        }
      ]
    },
    {
      "title": "Keystrokes (2025)",
      "image": "keystrokes-preview.png",
      "info": [
        {
          "title": "Keystrokes",
          "summary": "https://peter-tres.itch.io/piano-game",
          "link": true
        },
        {
          "title": "What I did",
          "summary": "Created a rhythm game inspired by Grand Piano Keys using Godot, applying object-oriented principles with modular scripts. Built reusable components for tile generation, input, and game state across multiple modes. Implemented local data saving for progress and high scores. Focused on clean architecture, event-driven programming, and efficient state management for smooth gameplay.",
          "link": false
        },
        {
          "title": "Worth Noting",
          "summary": "I developed a custom tool that reads MIDI files and converts them into a game-friendly format. This enables the game to dynamically load songs, allowing players to interact with accurate note patterns derived from the MIDI data.",
          "link": false
        },
        {
          "title": "Tools",
          "summary": "Godot, Python",
          "link": false
        },
        {
          "title": "Platforms",
          "summary": "Web",
          "link": false
        }
      ]
    }
  ]
}
